In [74]:
pip install psycopg2-binary

Requirement already satisfied: psycopg2-binary in /Users/av/jupyter-env/lib/python3.13/site-packages (2.9.10)

[notice] A new release of pip is available: 25.0.1 -> 25.1.1
[notice] To update, run: pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [29]:
pip install sqlalchemy

Collecting sqlalchemy
  Downloading sqlalchemy-2.0.41-cp313-cp313-macosx_10_13_x86_64.whl.metadata (9.6 kB)
Collecting greenlet>=1 (from sqlalchemy)
  Downloading greenlet-3.2.3-cp313-cp313-macosx_11_0_universal2.whl.metadata (4.1 kB)
Requirement already satisfied: typing-extensions>=4.6.0 in /Users/av/jupyter-env/lib/python3.13/site-packages (from sqlalchemy) (4.13.2)
Downloading sqlalchemy-2.0.41-cp313-cp313-macosx_10_13_x86_64.whl (2.1 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 2.1/2.1 MB 25.3 MB/s eta 0:00:00
Downloading greenlet-3.2.3-cp313-cp313-macosx_11_0_universal2.whl (270 kB)
Installing collected packages: greenlet, sqlalchemy
Successfully installed greenlet-3.2.3 sqlalchemy-2.0.41

[notice] A new release of pip is available: 25.0.1 -> 25.1.1
[notice] To update, run: pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [40]:
import pandas as pd
import psycopg2
from sqlalchemy import create_engine

In [41]:
movies_df = pd.read_csv("SOURCE DATA/netflix_movies.csv")

In [ ]:
movies_df.info()

In [42]:
movies_df.head()

   movie_id                      title     genre  release_year
0         1            Number Congress    Action          2017
1         2  Employee behavior account  Thriller          2005
2         3         Window around that   Romance          1982
3         4                Wide agency    Comedy          1993
4         5               Rather agree     Drama          2019

In [ ]:
movies_df.count()

In [43]:
users_df = pd.read_csv("SOURCE DATA/netflix_users.csv")

In [44]:
ratings_df = pd.read_csv("SOURCE DATA/netflix_ratings.csv")

In [45]:
watchhistory_df = pd.read_csv("SOURCE DATA/netflix_watch_history.csv")

In [46]:
users_df.head()

   user_id             name                   email plan_type
0        1  Heather Patrick      peggy79@martin.org     Basic
1        2   Michael Bailey       eddie46@yahoo.com  Standard
2        3        Amy Burns   foliver@gallagher.com     Basic
3        4       Cody Estes  allenerika@hotmail.com   Premium
4        5  Richard Schultz      tmerritt@gmail.com     Basic

In [47]:
ratings_df.head()

   rating_id  user_id  movie_id  rating             rated_at
0          1       13        11       3  2025-03-17 02:43:02
1          2       44        20       5  2024-09-26 15:57:16
2          3       47         6       5  2025-04-29 08:08:54
3          4        5        38       5  2023-10-18 05:01:15
4          5       29        23       3  2024-08-09 10:30:36

In [48]:
watchhistory_df.head()

   history_id  user_id  movie_id           watched_at
0           1       23        21  2025-04-05 06:20:02
1           2       34        18  2024-03-01 14:16:32
2           3       39        29  2024-12-19 09:14:42
3           4        8        47  2024-03-26 05:58:02
4           5       15         1  2023-12-22 00:20:47

In [49]:
# ERD

In [50]:
# we need to connect our database to this notebook to communicate
#this isnt intuitive , google is always needed
try:
    connection = psycopg2.connect(dbname="NETFLIX_DATABASE", user='postgres', password='postgres', port='5432')
except:
    print("connection was unsuccessful")

In [55]:
cursor = connection.cursor()

All execute commands are part of a transaction by default.
If one command fails, the entire transaction is marked as "failed."
Until you ROLLBACK, PostgreSQL ignores all future commands, even reads.

In [ ]:
connection.commit()
connection.rollback()

In [ ]:
cursor.execute("""
CREATE TABLE Movies (
    movie_id SERIAL PRIMARY KEY,
    title TEXT NOT NULL,
    genre VARCHAR(50),
    release_year INTEGER
);
""")

In [67]:
# try:
#     cursor.execute("""
#     CREATE TABLE users (
#         user_id SERIAL PRIMARY KEY,
#         name VARCHAR(50) NOT NULL,
#         email VARCHAR(100) UNIQUE NOT NULL,
#         plan_type VARCHAR(20) CHECK (plan_type IN ('Basic', 'Standard', 'Premium'))
#     );
#     """)
#     connection.commit()
# except Exception as e:
#     print("Something went wrong:", e)
#     connection.rollback()

In [65]:
cursor.execute("""
CREATE TABLE users (
    user_id SERIAL PRIMARY KEY,
    name VARCHAR(50) NOT NULL,
    email VARCHAR(100) UNIQUE NOT NULL,
    plan_type VARCHAR(20) CHECK (plan_type IN ('Basic', 'Standard', 'Premium'))
);
""")

In [ ]:
cursor.execute("""
CREATE TABLE WatchHistory (
    history_id SERIAL PRIMARY KEY,
    user_id INTEGER REFERENCES Users(user_id),
    movie_id INTEGER REFERENCES Movies(movie_id),
    watched_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP
);
""")

In [ ]:
cursor.execute("""
CREATE TABLE Ratings (
    rating_id SERIAL PRIMARY KEY,
    user_id INTEGER REFERENCES Users(user_id),
    movie_id INTEGER REFERENCES Movies(movie_id),
    rating INTEGER CHECK (rating BETWEEN 1 AND 5),
    rated_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP
);
""")

In [ ]:
connection.commit()

### TRANSFORMATION

Recap from python course, we need to fix the data , remove nulls, remove bad charcters, remove rows with empty key info

In [69]:
movies_df = movies_df.drop_duplicates()
movies_df.isnull().sum()
movies_df = movies_df.dropna(subset=['title', 'release_year'])
movies_df['genre'] = movies_df['genre'].fillna('Unknown')

In [70]:
movies_df.count()

movie_id        50
title           50
genre           50
release_year    50
dtype: int64

In [62]:
engine = create_engine('postgresql+psycopg2://postgres:postgres@localhost/NETFLIX_DATABASE')

In [1]:
movies_df.to_sql('movies', con=engine, if_exists='replace', index=False)

NameError: name 'movies_df' is not defined

In [75]:
users_df.to_sql('users', con=engine, if_exists='append', index=False)

50

In [76]:
ratings_df.to_sql('ratings', con=engine, if_exists='append', index=False)

50

In [77]:
watchhistory_df.to_sql('watchhistory', con=engine, if_exists='append', index=False)

50